In [2]:
import pandas as pd

In [3]:
data = {
    'name': ['John', 'Anna', 'Peter', 'Linda'],
    'age': [28, 24, 35, 32],
    'city': ['New York', 'Paris', 'Berlin', 'London']
}

df = pd.DataFrame(data)

df

    name  age      city
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [5]:
data = [
    {'name': 'John', 'age': 28, 'city': 'New York'},
    {'name': 'Anna', 'age': 24, 'city': 'Paris'},
    {'name': 'Peter', 'age': 35, 'city': 'Berlin'},
    {'name': 'Linda', 'age': 32, 'city': 'London'}
]

df = pd.DataFrame(data)

df

    name  age      city
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [6]:
data = [
    ['John', 28, 'New York'],
    ['Anna', 24, 'Paris'],
    ['Peter', 35, 'Berlin'],
    ['Linda', 32, 'London']
]

df = pd.DataFrame(data, columns=['name', 'age', 'city'])

df

    name  age      city
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [7]:
import numpy as np

data = np.array([[1, 2, 3], [4, 5, 6]])

df = pd.DataFrame(data, columns=['A', 'B', 'C'])

   A  B  C
0  1  2  3
1  4  5  6

In [8]:
data.shape

(2, 3)

In [10]:
data = [
    ['John', 28, 'New York'],
    ['Anna', 24, 'Paris'],
    ['Peter', 35, 'Berlin'],
    ['Linda', 32, 'London']
]

df = pd.DataFrame(data, columns=['name', 'age', 'city'])

df

    name  age      city
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [11]:
df.to_csv('data.csv', index=False)

In [12]:
df = pd.read_csv('data.csv')
df

    name  age      city
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

COLUMN INDEXING

In [37]:
df = pd.read_csv('data.csv')
df

    name  age      city
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [20]:
df['name']

0     John
1     Anna
2    Peter
3    Linda
Name: name, dtype: object

In [19]:
type(df['name'])

pandas.core.series.Series

In [5]:
df['age']

name
John     28
Anna     24
Peter    35
Linda    32
Name: age, dtype: int64

In [6]:
ages = df['age']

In [7]:
ages>25

name
John      True
Anna     False
Peter     True
Linda     True
Name: age, dtype: bool

In [12]:
df = df.set_index('name')

# df.set_index('name', inplace=True) - Lo de arriba y lo de abajo es lo mismo, pero arriba estoy deliberadamente redefiniiendo mi propia variable

In [13]:
df

       age      city
name
John    28  New York
Anna    24     Paris
Peter   35    Berlin
Linda   32    London

In [14]:
df = df.reset_index()

In [15]:
df

    name  age      city
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

ROW INDEXING

In [30]:
df.loc['Peter'] #Aqui le estoy pidiendo los valores de un dato determinado

age         35
city    Berlin
Name: Peter, dtype: object

In [25]:
df.loc[0]  # Aqui le estoy pidiendo los valores de un posicionamiento determinado

name        John
age           28
city    New York
Name: 0, dtype: object

In [38]:
df.loc[0], df.iloc[0] #En este caso porque el indice 0,1,2 coincide con el nombre de la fila, estos 2 valores son iguales.

(name        John
 age           28
 city    New York
 Name: 0, dtype: object,
 name        John
 age           28
 city    New York
 Name: 0, dtype: object)

In [32]:
mask = df['age']>25

mask

name
John      True
Anna     False
Peter     True
Linda     True
Name: age, dtype: bool

In [33]:
df

       age      city
name
John    28  New York
Anna    24     Paris
Peter   35    Berlin
Linda   32    London

In [35]:
df [mask]

       age      city
name
John    28  New York
Peter   35    Berlin
Linda   32    London

In [45]:
# Create a DataFrame by passing a numpy array, with a datetime index and labeled columns
data = [
    ['John', 28, 1.82],
    ['Anna', None, 1.65],
    ['Peter', 35, 1.76],
    ['John', 28, 1.82],
    ['Linda', 32, 1.79],
    ['Alice', 41, None],
    ['Carl', 29, 1.72],
]

df = pd.DataFrame(data, columns=['name', 'age', 'height'])
df = df.set_index("name")
df

        age  height
name
John   28.0    1.82
Anna    NaN    1.65
Peter  35.0    1.76
John   28.0    1.82
Linda  32.0    1.79
Alice  41.0     NaN
Carl   29.0    1.72

In [42]:
df.isna()

         age  height
name
John   False   False
Anna    True   False
Peter  False   False
John   False   False
Linda  False   False
Alice  False    True
Carl   False   False

In [43]:
df.isna().sum()

age       1
height    1
dtype: int64

In [49]:
clean_df = df.dropna()

clean_df

        age  height
name
John   28.0    1.82
Peter  35.0    1.76
John   28.0    1.82
Linda  32.0    1.79
Carl   29.0    1.72

In [50]:
df.fillna(0)

        age  height
name
John   28.0    1.82
Anna    0.0    1.65
Peter  35.0    1.76
John   28.0    1.82
Linda  32.0    1.79
Alice  41.0    0.00
Carl   29.0    1.72

In [51]:
df.fillna(df.mean())

             age  height
name
John   28.000000    1.82
Anna   32.166667    1.65
Peter  35.000000    1.76
John   28.000000    1.82
Linda  32.000000    1.79
Alice  41.000000    1.76
Carl   29.000000    1.72

In [52]:
df.duplicated()

name
John     False
Anna     False
Peter    False
John      True
Linda    False
Alice    False
Carl     False
dtype: bool

In [53]:
df.drop_duplicates()

        age  height
name
John   28.0    1.82
Anna    NaN    1.65
Peter  35.0    1.76
Linda  32.0    1.79
Alice  41.0     NaN
Carl   29.0    1.72

In [54]:
df['age'] = df['age'].astype(float)
df

        age  height
name
John   28.0    1.82
Anna    NaN    1.65
Peter  35.0    1.76
John   28.0    1.82
Linda  32.0    1.79
Alice  41.0     NaN
Carl   29.0    1.72